{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "8ZAU6Y5WxyCR"
      },
      "source": [
        "Para consultar datos, debemos tener 1) datos, y 2) un sitio donde consultarlos.\n",
        "\n",
        "En el contexto de esta asignatura, se espera que hayas desarrollado ya tu propio conjunto de datos y sobre ellos harás las consultas que entregues. No obstante, para esta sesión, utilizaré datos de DBpedia.\n",
        "\n",
        "En cuanto a dónde colocar tus datos para consultas, necesitamos un endpoint de SPARQL. Existen muchas alternativas:\n",
        "\n",
        "* Fuseki (https://jena.apache.org/documentation/fuseki2/#download-fuseki), parte de Apache Jena. Utilizado, por ejemplo, en YAGO (https://yago-knowledge.org/).  Los datos se dividen en datasets aislados entre sí. Cada dataset tendrá su propia URL para exponer un endpoint para consultas. Esto no quiere decir que cada dataset consista en un único grafo. Se pueden introducir distintos grafos dentro de un mismo dataset, y consultarlos por separado en el mismo endpoint utilizando sentencias graph en SPARQL (el modelo de tripletas evolucionaría al modelo de quads).\n",
        "\n",
        "* GraphDB (https://graphdb.ontotext.com/). Habitual en muchas empresas, con soporte comercial, robusto y estable.\n",
        "\n",
        "* Virtuoso (https://vos.openlinksw.com/owiki/wiki/VOS/VOSDownload). Usado, por ejemplo, en DBpedia.  Muy consolidada y estable. Opción comercial y edición open source. Fama de eficiente con grandes volúmenes de datos, pero parece que hay propuestas más recientes que le aventajan en ese aspecto.\n",
        "\n",
        "* Blazegrph(https://blazegraph.com/). Usado, por ejemplo, en Wikidata. Puede manejar muchos datos con la infraestructura adecuada, pero en Wikidata comienza a dar problemas. Sin soporte desde 2020 (la mayoría de sus ingenieros fueron contratados por Amazon Neptune). A pesar de que siga en Wikidata, la falta de soporte lo hace una opción arriesgada.\n",
        "\n",
        "* QLever(https://github.com/ad-freiburg/QLever). Diseñado para funcionar bien con enormes volumenes de datos. Sus datos anunciados en presentaciones o documentos de investigación son espectaculares comparándolos con el rendimiento de otros motores, pero no está lo suficientemente probado en entornos reales. Implementado y mantenido por institución académica\n",
        "\n",
        "* Oxigraph (https://github.com/oxigraph/oxigraph). Implementado en Rust, prometedor. Iniciativa OpenSource.\n",
        "\n",
        "* RDFox (https://www.oxfordsemantic.tech/download). No sólo funciona como motor de SPARQL típico, soporte a razonadores.\n",
        "\n",
        "En esta asignatura no pretendemos convertirte en un experto o experta en la administración de ningún endpoint concreto. No nos meteremos, en ningún caso, a hacer condiguraciones avanzadas de permisos de los mismos. Sólo buscamos que sepas que existen alternativas y seas capaz de instalar, poblar con datos y utilizar unpar cualquier de enpoints. Si no tienes ninguna preferencia, una opción factible sería instalar Fuseki y GraphDB. En ambos casos, tanto la instalación como el despliegue son sencillos y autoexplicativos en su versión básica. Pero puedes probar cualquier otro.\n",
        "\n",
        "En este enlace encontrarás una lista (incompleta) de motores de SPARQL: https://en.wikipedia.org/wiki/List_of_SPARQL_implementations\n",
        "\n",
        "En este otro, una lista (incompleta) de algunos endpoint públicos asociados a algún KG en RDF que puedes explorar a través de consultas SPARQL: https://www.w3.org/wiki/SparqlEndpoints\n",
        "\n",
        "\n",
        "En este Jupyter vamos a experimentar con el endpoint de DBpedia. Escogiendo como dominio libros y entidades relacionadas, iremos poniendo ejemplos de consultas con mayor complejidad cada vez, que quizá te sirvan de inspiración para obtener consultas relacionadas con tu propio conjunto de datos.\n",
        "\n",
        "Ejecutaremos estas consultas contra el endpoint de SPARQL de DBpedia utilizando SPARQLWrapper. Si prefieres utilizar el interfaz web para ver los resultados de las consultas, tan sólo copia y pega el string de la consulta que corresponda en el interfaz web del endpoint de DBpedia: https://dbpedia.org/sparql/\n",
        "\n",
        "ADVERTENCIA: Si quieres ejecutar consultas contra tu propio endpoint con tus datos desde Jupyter, ten en cuenta que, por defecto, las referencias a localhost no podrán resolverse. Utiliza una URL pública fija en su lugar una vez tengas tu endpoint desplegado en un servidor. Esto aplica a Jupyter en Colab, pero no a Python. Si ejecutas cierta consulta desde la consola de tu equipo o desde cualqueir IDE, las referencias a localhost funcionarán sin problema.\n",
        "\n",
        "\n",
        "\n",
        "\n"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## ACLARACIÓN IMPORTANTE\n",
        "\n",
        "En las consultas de ejemplo contra el endpoint de DBpedia, utilizaemos prefijos comunes como:\n",
        "* dbr --> http://dbpedia.org/resource/  -> Espacio de nombres para entidades (instancias) en DBpedia.\n",
        "* dbo --> http://dbpedia.org/ontology/  -> Espacio de nombres para conceptos (clases) en DBpedia.\n",
        "* rdfs --> http://www.w3.org/2000/01/rdf-schema# --> Espacio de nombres para algunas propiedades especiales y habituales de rdf, como rdfs:label para etiquetas, rdfs:comment para descripciones o rdfs:seeAlso para relacionar conceptos mediante un tipo de relación de semántica inespecífica.\n",
        "\n",
        "Esto funcionará aunque no hagamos declaraciones de prefijos al principio de la consulta. Pero esto no significa que cualqueir consulta SPARQL en cualquier endpoint vaya a funcionar sin declarar prefijos. Ocurre que el endpoint público de DBpedia maneja unos cuantos prefijos y espacios de nombres extremadamente comúnes para ahorrarnos que los escribamos. Pero es una particularidad de esta instalación concreta de este endpoint, no podemos asumir que funcionará así en otros."
      ],
      "metadata": {
        "id": "k3m63KEQp92I"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "JbQ4UnfO-uek",
        "outputId": "08af3c16-90cf-494d-f705-dbddcc34c094"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting sparqlwrapper\n",
            "  Downloading SPARQLWrapper-2.0.0-py3-none-any.whl.metadata (2.0 kB)\n",
            "Collecting rdflib>=6.1.1 (from sparqlwrapper)\n",
            "  Downloading rdflib-7.1.3-py3-none-any.whl.metadata (11 kB)\n",
            "Requirement already satisfied: pyparsing<4,>=2.1.0 in /usr/local/lib/python3.11/dist-packages (from rdflib>=6.1.1->sparqlwrapper) (3.2.1)\n",
            "Downloading SPARQLWrapper-2.0.0-py3-none-any.whl (28 kB)\n",
            "Downloading rdflib-7.1.3-py3-none-any.whl (564 kB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m564.9/564.9 kB\u001b[0m \u001b[31m11.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hInstalling collected packages: rdflib, sparqlwrapper\n",
            "Successfully installed rdflib-7.1.3 sparqlwrapper-2.0.0\n"
          ]
        }
      ],
      "source": [
        "!pip install sparqlwrapper"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "#Consulta para encontrar URIs de libros\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select * where {\n",
        "?s a dbo:Book\n",
        "}  LIMIT 100\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"  \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "wVpiZPueoPJR",
        "outputId": "64b89f14-7d3f-40c3-984b-5d0085b962a5"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "http://dbpedia.org/resource/Cabal_(novella)  \n",
            "http://dbpedia.org/resource/Caddo_Valley_Academy_Complex  \n",
            "http://dbpedia.org/resource/Cafe_Little_Wish  \n",
            "http://dbpedia.org/resource/Cage_on_the_Sea  \n",
            "http://dbpedia.org/resource/Caigentan  \n",
            "http://dbpedia.org/resource/Calcium_beta-hydroxy-beta-methylbutyrate  \n",
            "http://dbpedia.org/resource/Calcium_citrate_malate  \n",
            "http://dbpedia.org/resource/Calcium_glubionate  \n",
            "http://dbpedia.org/resource/Calcium_glucoheptonate  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  \n",
            "http://dbpedia.org/resource/Calcium_glycerylphosphate  \n",
            "http://dbpedia.org/resource/Calcium_pangamate  \n",
            "http://dbpedia.org/resource/Calculating_God  \n",
            "http://dbpedia.org/resource/Calculus  \n",
            "http://dbpedia.org/resource/Calculus_on_Manifolds_(book)  \n",
            "http://dbpedia.org/resource/California_Dreaming_(novel)  \n",
            "http://dbpedia.org/resource/California_Manual_on_Uniform_Traffic_Control_Devices  \n",
            "http://dbpedia.org/resource/Call_It_Courage  \n",
            "http://dbpedia.org/resource/Call_Me_Dave  \n",
            "http://dbpedia.org/resource/Call_Sign_Extortion_17  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  \n",
            "http://dbpedia.org/resource/Caltrate  \n",
            "http://dbpedia.org/resource/Calypso_(book)  \n",
            "http://dbpedia.org/resource/Cam_Burke  \n",
            "http://dbpedia.org/resource/Camaya_Falls  \n",
            "http://dbpedia.org/resource/Cambridge,_Corpus_Christi_College,_MS_178  \n",
            "http://dbpedia.org/resource/Camera_Obscura_(novel)  \n",
            "http://dbpedia.org/resource/Camera_obscura_(novel)  \n",
            "http://dbpedia.org/resource/Campaign_Sourcebook_and_Catacomb_Guide  \n",
            "http://dbpedia.org/resource/Campanology  \n",
            "http://dbpedia.org/resource/Campbell's_Soup_Cans  \n",
            "http://dbpedia.org/resource/Campus_novel  \n",
            "http://dbpedia.org/resource/Can't_Buy_Me_Like  \n",
            "http://dbpedia.org/resource/Canada_Land_Inventory  \n",
            "http://dbpedia.org/resource/Canadian_Certificate_of_Identity  \n",
            "http://dbpedia.org/resource/Canadian_Communications_Foundation  \n",
            "http://dbpedia.org/resource/Cancer_Ward  \n",
            "http://dbpedia.org/resource/Candide  \n",
            "http://dbpedia.org/resource/Candy_(Brooks_novel)  \n",
            "http://dbpedia.org/resource/Candy_Candy  \n",
            "http://dbpedia.org/resource/Candyfloss_(novel)  \n",
            "http://dbpedia.org/resource/Candyfreak  \n",
            "http://dbpedia.org/resource/Cannabis:_The_Illegalization_of_Weed_in_America  \n",
            "http://dbpedia.org/resource/Cannonball_(novel)  \n",
            "http://dbpedia.org/resource/Cantata_(Stravinsky)  \n",
            "http://dbpedia.org/resource/Cantata_Profana  \n",
            "http://dbpedia.org/resource/Cantata_academica  \n",
            "http://dbpedia.org/resource/Cantate!  \n",
            "http://dbpedia.org/resource/Canto_da_Solidão  \n",
            "http://dbpedia.org/resource/Canto_for_a_Gypsy  \n",
            "http://dbpedia.org/resource/Capital,_Volume_III  \n",
            "http://dbpedia.org/resource/Capital_and_Ideology  \n",
            "http://dbpedia.org/resource/Capital_and_Interest  \n",
            "http://dbpedia.org/resource/Capital_in_the_Twenty-First_Century  \n",
            "http://dbpedia.org/resource/Capoeira:_The_History_of_an_Afro-Brazilian_Martial_Art  \n",
            "http://dbpedia.org/resource/Cappadonna_Hits  \n",
            "http://dbpedia.org/resource/Caps_for_Sale  \n",
            "http://dbpedia.org/resource/Captain_Fantastic_and_the_Brown_Dirt_Cowboy  \n",
            "http://dbpedia.org/resource/Captain_Tempesta  \n",
            "http://dbpedia.org/resource/Captain_Underpants_and_the_Invasion...  \n",
            "http://dbpedia.org/resource/Captain_Underpants_and_the_Revolting_Revenge_of_the_Radioactive_Robo-Boxers  \n",
            "http://dbpedia.org/resource/Captain_from_Castile_(novel)  \n",
            "http://dbpedia.org/resource/Car-Jacked_(novel)  \n",
            "http://dbpedia.org/resource/Car_brez_zaklada  \n",
            "http://dbpedia.org/resource/Carbon_Dreams  \n",
            "http://dbpedia.org/resource/Carey_Baptist_College  \n",
            "http://dbpedia.org/resource/Carl's_Afternoon_in_the_Park  \n",
            "http://dbpedia.org/resource/Carl_Burgos  \n",
            "http://dbpedia.org/resource/Carlos_Celdran  \n",
            "http://dbpedia.org/resource/Carmen_Miserabile  \n",
            "http://dbpedia.org/resource/Carpe_Jugulum  \n",
            "http://dbpedia.org/resource/Carrie_(novel)  \n",
            "http://dbpedia.org/resource/Carrion_Comfort  \n",
            "http://dbpedia.org/resource/Carrying_the_Fire  \n",
            "http://dbpedia.org/resource/Cars:_Radiator_Springs_Adventures  \n",
            "http://dbpedia.org/resource/Cartography  \n",
            "http://dbpedia.org/resource/Carver_(novel)  \n",
            "http://dbpedia.org/resource/Cary_Bates  \n",
            "http://dbpedia.org/resource/Casanova_(novel)  \n",
            "http://dbpedia.org/resource/Case_Mansion  \n",
            "http://dbpedia.org/resource/Casino_Royale_(novel)  \n",
            "http://dbpedia.org/resource/Cass_Street_Park  \n",
            "http://dbpedia.org/resource/Cassandra_(novel)  \n",
            "http://dbpedia.org/resource/Cast_of_Criminals  \n",
            "http://dbpedia.org/resource/Caste:_The_Origins_of_Our_Discontents  \n",
            "http://dbpedia.org/resource/Castes_in_India:_Their_Mechanism,_Genesis_and_Development  \n",
            "http://dbpedia.org/resource/Casual_peeps_at_Sophia  \n",
            "http://dbpedia.org/resource/Cat_Country_(novel)  \n",
            "http://dbpedia.org/resource/Cat_Girl_Alliance  \n",
            "http://dbpedia.org/resource/Cat_O'Nine_Tales  \n",
            "http://dbpedia.org/resource/Cat_and_Mouse_(novel)  \n",
            "http://dbpedia.org/resource/Catalyst_(novel)  \n",
            "http://dbpedia.org/resource/Catastrophe_(book)  \n",
            "http://dbpedia.org/resource/Catch-22  \n",
            "http://dbpedia.org/resource/Catch_Me_if_You_Can_(book)  \n",
            "http://dbpedia.org/resource/Catch_the_Breeze  \n",
            "http://dbpedia.org/resource/Categories_for_the_Working_Mathematician  \n",
            "http://dbpedia.org/resource/Amblypoda  \n",
            "http://dbpedia.org/resource/Ambrosian_Iliad  \n",
            "http://dbpedia.org/resource/Ambrosio_de_Letinez  \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "#Consulta para encontrar URIs de libros además de la(s) etiqueta(s) asociadas a estas URIs\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select * where {\n",
        "?s a dbo:Book ;\n",
        "   rdfs:label ?label .\n",
        "}  LIMIT 100\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"  \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "UJNyUIAorhhH",
        "outputId": "77fd1d89-ff34-4d50-9c84-27a4b9e3e649"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "http://dbpedia.org/resource/Cabal_(novella)  Cabal  \n",
            "http://dbpedia.org/resource/Cabal_(novella)  Cabal (novella)  \n",
            "http://dbpedia.org/resource/Cabal_(novella)  Cabal (romanzo)  \n",
            "http://dbpedia.org/resource/Cabal_(novella)  Ночной народ (роман)  \n",
            "http://dbpedia.org/resource/Cabal_(novella)  Кабал  \n",
            "http://dbpedia.org/resource/Caddo_Valley_Academy_Complex  Caddo Valley Academy Complex  \n",
            "http://dbpedia.org/resource/Cafe_Little_Wish  Cafe Little Wish  \n",
            "http://dbpedia.org/resource/Cafe_Little_Wish  Cafe Little Wish  \n",
            "http://dbpedia.org/resource/Cafe_Little_Wish  Cafe Little Wish  \n",
            "http://dbpedia.org/resource/Cage_on_the_Sea  Cage on the Sea  \n",
            "http://dbpedia.org/resource/Caigentan  Caigentan  \n",
            "http://dbpedia.org/resource/Caigentan  Propos sur la racine des légumes  \n",
            "http://dbpedia.org/resource/Caigentan  菜根譚  \n",
            "http://dbpedia.org/resource/Caigentan  채근담  \n",
            "http://dbpedia.org/resource/Caigentan  Caigentan  \n",
            "http://dbpedia.org/resource/Caigentan  菜根譚  \n",
            "http://dbpedia.org/resource/Calcium_beta-hydroxy-beta-methylbutyrate  Calcium beta-hydroxy-beta-methylbutyrate  \n",
            "http://dbpedia.org/resource/Calcium_citrate_malate  Calcium citrate malate  \n",
            "http://dbpedia.org/resource/Calcium_glubionate  Calcium glubionate  \n",
            "http://dbpedia.org/resource/Calcium_glucoheptonate  Calcium glucoheptonate  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  غلوكونات الكالسيوم  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Gluconat de calci  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Glukonát vápenatý  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Calciumgluconat  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Gluconato cálcico  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Calcium gluconate  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Kalsium glukonat  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Gluconato di calcio  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Gluconate de calcium  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  グルコン酸カルシウム  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Calciumgluconaat  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Glukonian wapnia  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Gluconato de cálcio  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Глюконат кальция  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  葡萄糖酸钙  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Глюконат кальцію  \n",
            "http://dbpedia.org/resource/Calcium_glycerylphosphate  فوسفات غليسيريل الكالسيوم  \n",
            "http://dbpedia.org/resource/Calcium_glycerylphosphate  Calcium glycerylphosphate  \n",
            "http://dbpedia.org/resource/Calcium_glycerylphosphate  Glycérophosphate de calcium  \n",
            "http://dbpedia.org/resource/Calcium_glycerylphosphate  Глицерофосфат кальция  \n",
            "http://dbpedia.org/resource/Calcium_glycerylphosphate  Гліцерофосфат кальцію  \n",
            "http://dbpedia.org/resource/Calcium_pangamate  Calcium pangamate  \n",
            "http://dbpedia.org/resource/Calculating_God  Calculating God  \n",
            "http://dbpedia.org/resource/Calculating_God  El cálculo de Dios  \n",
            "http://dbpedia.org/resource/Calculating_God  Calculating God  \n",
            "http://dbpedia.org/resource/Calculating_God  Calculating God  \n",
            "http://dbpedia.org/resource/Calculating_God  L'equazione di Dio  \n",
            "http://dbpedia.org/resource/Calculating_God  Вираховуючи Бога  \n",
            "http://dbpedia.org/resource/Calculus  Calculus  \n",
            "http://dbpedia.org/resource/Calculus  تفاضل وتكامل  \n",
            "http://dbpedia.org/resource/Calculus  Càlcul infinitesimal  \n",
            "http://dbpedia.org/resource/Calculus  Infinitezimální počet  \n",
            "http://dbpedia.org/resource/Calculus  Infinitesimalrechnung  \n",
            "http://dbpedia.org/resource/Calculus  Λογισμός  \n",
            "http://dbpedia.org/resource/Calculus  Infinitezima kalkulo  \n",
            "http://dbpedia.org/resource/Calculus  Cálculo infinitesimal  \n",
            "http://dbpedia.org/resource/Calculus  Kalkulu infinitesimal  \n",
            "http://dbpedia.org/resource/Calculus  Calcalas  \n",
            "http://dbpedia.org/resource/Calculus  Calcul infinitésimal  \n",
            "http://dbpedia.org/resource/Calculus  Kalkulus  \n",
            "http://dbpedia.org/resource/Calculus  Calcolo infinitesimale  \n",
            "http://dbpedia.org/resource/Calculus  미적분학  \n",
            "http://dbpedia.org/resource/Calculus  微分積分学  \n",
            "http://dbpedia.org/resource/Calculus  Rachunek różniczkowy i całkowy  \n",
            "http://dbpedia.org/resource/Calculus  Wiskundige analyse  \n",
            "http://dbpedia.org/resource/Calculus  Cálculo infinitesimal  \n",
            "http://dbpedia.org/resource/Calculus  Математический анализ  \n",
            "http://dbpedia.org/resource/Calculus  Infinitesimalkalkyl  \n",
            "http://dbpedia.org/resource/Calculus  微积分学  \n",
            "http://dbpedia.org/resource/Calculus  Диференціальне та інтегральне числення  \n",
            "http://dbpedia.org/resource/Calculus_on_Manifolds_(book)  Calculus on Manifolds (book)  \n",
            "http://dbpedia.org/resource/Calculus_on_Manifolds_(book)  Calculus on Manifolds (書籍)  \n",
            "http://dbpedia.org/resource/California_Dreaming_(novel)  California Dreaming (novel)  \n",
            "http://dbpedia.org/resource/California_Manual_on_Uniform_Traffic_Control_Devices  California Manual on Uniform Traffic Control Devices  \n",
            "http://dbpedia.org/resource/Call_It_Courage  Call It Courage  \n",
            "http://dbpedia.org/resource/Call_It_Courage  Odvaha (kniha)  \n",
            "http://dbpedia.org/resource/Call_It_Courage  Le Garçon qui avait peur  \n",
            "http://dbpedia.org/resource/Call_Me_Dave  Call Me Dave  \n",
            "http://dbpedia.org/resource/Call_Sign_Extortion_17  Call Sign Extortion 17  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  Call for the Dead  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  Schatten von gestern  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  Llamada para el muerto  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  L'Appel du mort  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  Chiamata per il morto  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  Budzenie zmarłych  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  Call for the Dead  \n",
            "http://dbpedia.org/resource/Caltrate  Caltrate  \n",
            "http://dbpedia.org/resource/Calypso_(book)  Calypso (book)  \n",
            "http://dbpedia.org/resource/Cam_Burke  Cam Burke  \n",
            "http://dbpedia.org/resource/Camaya_Falls  Camaya Falls  \n",
            "http://dbpedia.org/resource/Camaya_Falls  Cascadas de Camaya  \n",
            "http://dbpedia.org/resource/Cambridge,_Corpus_Christi_College,_MS_178  Cambridge, Corpus Christi College, MS 178  \n",
            "http://dbpedia.org/resource/Camera_Obscura_(novel)  Camera Obscura (novel)  \n",
            "http://dbpedia.org/resource/Camera_obscura_(novel)  Camera obscura (novel)  \n",
            "http://dbpedia.org/resource/Campaign_Sourcebook_and_Catacomb_Guide  Campaign Sourcebook and Catacomb Guide  \n",
            "http://dbpedia.org/resource/Campanology  Campanology  \n",
            "http://dbpedia.org/resource/Campanology  Kampanologie  \n",
            "http://dbpedia.org/resource/Campanology  Campanologie  \n",
            "http://dbpedia.org/resource/Campanology  Clingireacht  \n",
            "http://dbpedia.org/resource/Campanology  Campanologie  \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Libros y sus etiquetas, pero sólo aquellas etiquetas que se señale explícitamente que están en español.\n",
        "\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select * where {\n",
        "?s a dbo:Book ;\n",
        "   rdfs:label ?label .\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "}  LIMIT 100\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"  \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "7uyKGS_drycm",
        "outputId": "b8121768-5740-4431-b6a1-1ededd98d3a6"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "http://dbpedia.org/resource/Cabal_(novella)  Cabal  \n",
            "http://dbpedia.org/resource/Calcium_gluconate  Gluconato cálcico  \n",
            "http://dbpedia.org/resource/Calculating_God  El cálculo de Dios  \n",
            "http://dbpedia.org/resource/Calculus  Cálculo infinitesimal  \n",
            "http://dbpedia.org/resource/Call_for_the_Dead  Llamada para el muerto  \n",
            "http://dbpedia.org/resource/Camaya_Falls  Cascadas de Camaya  \n",
            "http://dbpedia.org/resource/Campbell's_Soup_Cans  Latas de sopa Campbell  \n",
            "http://dbpedia.org/resource/Cancer_Ward  Pabellón del cáncer  \n",
            "http://dbpedia.org/resource/Candide  Cándido  \n",
            "http://dbpedia.org/resource/Candy_Candy  Candy Candy  \n",
            "http://dbpedia.org/resource/Capital_in_the_Twenty-First_Century  El capital en el siglo XXI  \n",
            "http://dbpedia.org/resource/Captain_Fantastic_and_the_Brown_Dirt_Cowboy  Captain Fantastic and the Brown Dirt Cowboy  \n",
            "http://dbpedia.org/resource/Captain_Tempesta  El capitán Tormenta  \n",
            "http://dbpedia.org/resource/Carpe_Jugulum  Carpe Jugulum  \n",
            "http://dbpedia.org/resource/Carrie_(novel)  Carrie (novela)  \n",
            "http://dbpedia.org/resource/Carrion_Comfort  Los vampiros de la mente  \n",
            "http://dbpedia.org/resource/Cars:_Radiator_Springs_Adventures  Cars: Radiator Springs Adventures  \n",
            "http://dbpedia.org/resource/Cartography  Cartografía  \n",
            "http://dbpedia.org/resource/Casino_Royale_(novel)  Casino Royale (novela)  \n",
            "http://dbpedia.org/resource/Catch-22  Trampa 22 (libro)  \n",
            "http://dbpedia.org/resource/Ambrosian_Iliad  Ilias Picta  \n",
            "http://dbpedia.org/resource/Amduat  Libro del Amduat  \n",
            "http://dbpedia.org/resource/America's_60_Families  60 Familias de los Estados Unidos  \n",
            "http://dbpedia.org/resource/America's_Great_Depression  La Gran Depresión (libro)  \n",
            "http://dbpedia.org/resource/American_Cookery  American Cookery  \n",
            "http://dbpedia.org/resource/American_Theocracy  American Theocracy  \n",
            "http://dbpedia.org/resource/Americanah  Americanah  \n",
            "http://dbpedia.org/resource/Amerika_(novel)  América (novela)  \n",
            "http://dbpedia.org/resource/Amok_(novella)  Amok (libro)  \n",
            "http://dbpedia.org/resource/Among_Others  Entre extraños  \n",
            "http://dbpedia.org/resource/Amsterdam_(novel)  Ámsterdam (novela)  \n",
            "http://dbpedia.org/resource/Amulet_(novel)  Amuleto (novela)  \n",
            "http://dbpedia.org/resource/A_Clockwork_Orange  La naranja mecánica (desambiguación)  \n",
            "http://dbpedia.org/resource/Bay_Psalm_Book  Bay Psalm Book  \n",
            "http://dbpedia.org/resource/Beard  Barba  \n",
            "http://dbpedia.org/resource/Beastly  Beastly  \n",
            "http://dbpedia.org/resource/Beau_Geste  Beau Geste  \n",
            "http://dbpedia.org/resource/Beautiful_Chaos_(Garcia_and_Stohl_novel)  Hermoso caos  \n",
            "http://dbpedia.org/resource/Beautiful_Creatures_(novel)  Hermosas criaturas  \n",
            "http://dbpedia.org/resource/Beautiful_Darkness  Hermosa oscuridad  \n",
            "http://dbpedia.org/resource/Beautiful_Disaster_(novel)  Maravilloso Desastre  \n",
            "http://dbpedia.org/resource/Beauty_and_Sadness_(novel)  Lo bello y lo triste  \n",
            "http://dbpedia.org/resource/Beck's_triad_(cardiology)  Tríada de Beck (Cardiología)  \n",
            "http://dbpedia.org/resource/Beggars_in_Spain  Mendigos en España  \n",
            "http://dbpedia.org/resource/Behavioral_ecology  Ecología del comportamiento  \n",
            "http://dbpedia.org/resource/Behind_Her_Eyes_(novel)  Behind Her Eyes  \n",
            "http://dbpedia.org/resource/Behind_the_Curtain  Detrás del telón  \n",
            "http://dbpedia.org/resource/Behold_the_Man_(novel)  He aquí el hombre  \n",
            "http://dbpedia.org/resource/Beige_Book  Libro beige  \n",
            "http://dbpedia.org/resource/Beige_Planet_Mars  Beige Planet Mars  \n",
            "http://dbpedia.org/resource/Beijing_Coma  Pekín en Coma  \n",
            "http://dbpedia.org/resource/Being_and_Nothingness  El ser y la nada  \n",
            "http://dbpedia.org/resource/Being_and_Time  Ser y tiempo  \n",
            "http://dbpedia.org/resource/Beit_Yosef_(book)  Beit Yossef  \n",
            "http://dbpedia.org/resource/Bel-Ami  Bel Ami  \n",
            "http://dbpedia.org/resource/Belgic_Confession  Confesión belga  \n",
            "http://dbpedia.org/resource/Belle_du_Seigneur  Bella del Señor  \n",
            "http://dbpedia.org/resource/Belles_Heures_of_Jean_de_France,_Duc_de_Berry  Las bellas horas de Jean de Berry  \n",
            "http://dbpedia.org/resource/Belmont_Report  Informe Belmont  \n",
            "http://dbpedia.org/resource/Beloved_(novel)  Beloved (novela)  \n",
            "http://dbpedia.org/resource/Ben,_in_the_World  Ben, en el mundo  \n",
            "http://dbpedia.org/resource/Beneath_the_Wheel  Bajo las ruedas  \n",
            "http://dbpedia.org/resource/Pramface  Pramface (serie de televisión)  \n",
            "http://dbpedia.org/resource/Pre-Madonna  Pre-Madonna  \n",
            "http://dbpedia.org/resource/Preload_(cardiology)  Precarga  \n",
            "http://dbpedia.org/resource/Presumed_Innocent_(novel)  Presunto inocente  \n",
            "http://dbpedia.org/resource/Pride_and_Prejudice  Orgullo y prejuicio (novela)  \n",
            "http://dbpedia.org/resource/Prime_k-tuple  K-tupla de números primos  \n",
            "http://dbpedia.org/resource/Prince_Caspian  El príncipe Caspian  \n",
            "http://dbpedia.org/resource/Principia_Mathematica  Principia Mathematica  \n",
            "http://dbpedia.org/resource/Prisoners_of_the_Sun  El templo del Sol  \n",
            "http://dbpedia.org/resource/Privilegium_Maius  Privilegium Maius  \n",
            "http://dbpedia.org/resource/Programme_for_International_Student_Assessment  Informe PISA  \n",
            "http://dbpedia.org/resource/Project_Plowshare  Operación Plowshare  \n",
            "http://dbpedia.org/resource/Proxemics  Proxemia  \n",
            "http://dbpedia.org/resource/Prueba_de_Selección_Universitaria  Prueba de Selección Universitaria  \n",
            "http://dbpedia.org/resource/Psalms  Libro de los salmos  \n",
            "http://dbpedia.org/resource/Psalter  Salterio (libro de salmos)  \n",
            "http://dbpedia.org/resource/Psychological_Types  Tipos psicológicos  \n",
            "http://dbpedia.org/resource/Psychology  Psicología  \n",
            "http://dbpedia.org/resource/Psychoneuroendocrinology  Psiconeuroendocrinología  \n",
            "http://dbpedia.org/resource/Public_policy  Políticas públicas  \n",
            "http://dbpedia.org/resource/Pure_(Miller_novel)  Pure (novela)  \n",
            "http://dbpedia.org/resource/Purple_Hibiscus  Purple Hibiscus  \n",
            "http://dbpedia.org/resource/Puss_in_Boots  El Gato con Botas  \n",
            "http://dbpedia.org/resource/Pyomo  Pyomo  \n",
            "http://dbpedia.org/resource/Pyramids_(novel)  Pirómides  \n",
            "http://dbpedia.org/resource/Qidan_Guo_Zhi  Qidan Guozhi  \n",
            "http://dbpedia.org/resource/Quality_management_system  Sistema de gestión de la calidad  \n",
            "http://dbpedia.org/resource/Quassia  Quassia  \n",
            "http://dbpedia.org/resource/Queen's_Road,_Hong_Kong  Queen's Road (Hong Kong)  \n",
            "http://dbpedia.org/resource/Queen_Victoria's_journals  Diarios de Victoria del Reino Unido  \n",
            "http://dbpedia.org/resource/Quenta_Silmarillion  Quenta Silmarillion  \n",
            "http://dbpedia.org/resource/Querimonia  Era Querimònia  \n",
            "http://dbpedia.org/resource/Quest_for_a_Throne  A la conquista de un imperio  \n",
            "http://dbpedia.org/resource/Quid_(encyclopedia)  Quid (enciclopedia)  \n",
            "http://dbpedia.org/resource/Quidditch_Through_the_Ages  Quidditch a través de los tiempos  \n",
            "http://dbpedia.org/resource/Robinson_Crusoe  Robinson Crusoe  \n",
            "http://dbpedia.org/resource/Robotics;Notes  Robotics;Notes  \n",
            "http://dbpedia.org/resource/Rock_Islands  Islas Chelbacheb  \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Lo mismo de antes, pero sólo novelas de fantasía\n",
        "\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select * where {\n",
        "?s a dbo:Book ;\n",
        "   rdfs:label ?label ;\n",
        "   dbo:literaryGenre dbr:Fantasy_novel .\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "\n",
        "}  LIMIT 100\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"  \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "KepOIU-qscA-",
        "outputId": "3f5bf82d-b62a-4aa6-bacc-82a19b20b9c5"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "http://dbpedia.org/resource/Beautiful_Chaos_(Garcia_and_Stohl_novel)  Hermoso caos  \n",
            "http://dbpedia.org/resource/Beautiful_Creatures_(novel)  Hermosas criaturas  \n",
            "http://dbpedia.org/resource/Beautiful_Darkness  Hermosa oscuridad  \n",
            "http://dbpedia.org/resource/Midnight_Sun_(Meyer_novel)  Sol de medianoche (novela)  \n",
            "http://dbpedia.org/resource/Momo_(novel)  Momo (novela)  \n",
            "http://dbpedia.org/resource/The_Amulet_of_Samarkand  El amuleto de Samarkanda  \n",
            "http://dbpedia.org/resource/Day_Watch_(novel)  Guardianes del día  \n",
            "http://dbpedia.org/resource/Dead_Until_Dark  Muerto hasta el anochecer  \n",
            "http://dbpedia.org/resource/Dead_as_a_Doornail  Más muerto que nunca  \n",
            "http://dbpedia.org/resource/All_Together_Dead  De muerto en peor  \n",
            "http://dbpedia.org/resource/All_Together_Dead  Todos juntos y muertos  \n",
            "http://dbpedia.org/resource/Hush,_Hush  Hush, Hush (novela)  \n",
            "http://dbpedia.org/resource/Beyond_the_Shadows  Más allá de las sombras (novela)  \n",
            "http://dbpedia.org/resource/Dead_Reckoning_(novel)  El día del juicio mortal  \n",
            "http://dbpedia.org/resource/Dead_and_Gone_(novel)  Muerto y enterrado  \n",
            "http://dbpedia.org/resource/Dead_in_the_Family  Muerto en familia  \n",
            "http://dbpedia.org/resource/Deadhouse_Gates  Las puertas de la Casa de la Muerte  \n",
            "http://dbpedia.org/resource/Declare  Declara (novela)  \n",
            "http://dbpedia.org/resource/Definitely_Dead  Definitivamente muerta  \n",
            "http://dbpedia.org/resource/The_Alchemist_(novel)  El alquimista (novela)  \n",
            "http://dbpedia.org/resource/The_Night_Land  El reino de la noche  \n",
            "http://dbpedia.org/resource/The_Book_of_Three  El libro de los tres  \n",
            "http://dbpedia.org/resource/Memories_of_Ice  Memorias del hielo  \n",
            "http://dbpedia.org/resource/Night_Watch_(Lukyanenko_novel)  Guardianes de la noche  \n",
            "http://dbpedia.org/resource/Oath_Breaker_(novel)  El juramento de Torak  \n",
            "http://dbpedia.org/resource/Outcast_(Paver_novel)  La hechicera (novela)  \n",
            "http://dbpedia.org/resource/Midnight_Tides  Mareas de medianoche  \n",
            "http://dbpedia.org/resource/The_Golem's_Eye  El ojo del Golem  \n",
            "http://dbpedia.org/resource/Clockwork_Prince  Príncipe mecánico  \n",
            "http://dbpedia.org/resource/Clockwork_Princess  Princesa mecánica  \n",
            "http://dbpedia.org/resource/Mistborn:_The_Well_of_Ascension  El pozo de la ascensión  \n",
            "http://dbpedia.org/resource/The_Last_Olympian  El último héroe del Olimpo  \n",
            "http://dbpedia.org/resource/The_Little_Vampire_(book_series)  El pequeño vampiro (saga)  \n",
            "http://dbpedia.org/resource/The_Lost_Hero  El héroe perdido  \n",
            "http://dbpedia.org/resource/The_Magicians'_Guild  El gremio de los magos  \n",
            "http://dbpedia.org/resource/The_Mark_of_Athena  La marca de Atenea  \n",
            "http://dbpedia.org/resource/The_Once_and_Future_King  Camelot (novelas)  \n",
            "http://dbpedia.org/resource/The_Red_Pyramid  La pirámide roja  \n",
            "http://dbpedia.org/resource/The_Son_of_Neptune  El hijo de Neptuno  \n",
            "http://dbpedia.org/resource/The_Summer_Tree  El árbol del verano  \n",
            "http://dbpedia.org/resource/The_Way_of_Shadows  El camino de las sombras (novela)  \n",
            "http://dbpedia.org/resource/The_Wonderful_Wizard_of_Oz  El maravilloso mago de Oz  \n",
            "http://dbpedia.org/resource/Living_Dead_in_Dallas  Living Dead in Dallas  \n",
            "http://dbpedia.org/resource/Skulduggery_Pleasant  Detective Esqueleto  \n",
            "http://dbpedia.org/resource/Skulduggery_Pleasant_(novel)  Skulduggery pleasant  \n",
            "http://dbpedia.org/resource/Clockwork_Angel  Ángel mecánico  \n",
            "http://dbpedia.org/resource/Club_Dead  El club de los muertos  \n",
            "http://dbpedia.org/resource/From_Dead_to_Worse  De muerto en peor  \n",
            "http://dbpedia.org/resource/From_Dead_to_Worse  Todos juntos y muertos  \n",
            "http://dbpedia.org/resource/House_of_Chains  La Casa de Cadenas  \n",
            "http://dbpedia.org/resource/Passion_(novel)  La trampa del amor  \n",
            "http://dbpedia.org/resource/Spirit_Walker_(novel)  El clan de la foca  \n",
            "http://dbpedia.org/resource/The_Subtle_Knife  La daga  \n",
            "http://dbpedia.org/resource/The_Amber_Spyglass  La materia oscura  \n",
            "http://dbpedia.org/resource/The_Amber_Spyglass  El catalejo lacado  \n",
            "http://dbpedia.org/resource/Tuck_Everlasting  Tuck Everlasting  \n",
            "http://dbpedia.org/resource/Twilight_(Meyer_novel)  Crepúsculo (novela)  \n",
            "http://dbpedia.org/resource/Twilight_(Meyer_novel)  Profundidades  \n",
            "http://dbpedia.org/resource/Twilight_(Meyer_novel)  Túneles (novela)  \n",
            "http://dbpedia.org/resource/Dragonsbane  Vencer al dragón  \n",
            "http://dbpedia.org/resource/Dreamsongs:_A_RRetrospective  George R. R. Martin: Autobiografía literaria  \n",
            "http://dbpedia.org/resource/Jumanji_(picture_book)  Jumanji  \n",
            "http://dbpedia.org/resource/Shadow's_Edge  Al filo de las sombras  \n",
            "http://dbpedia.org/resource/The_City_of_Dreaming_Books  La ciudad de los libros soñadores  \n",
            "http://dbpedia.org/resource/Wolf_Brother  Hermano lobo (novela)  \n",
            "http://dbpedia.org/resource/Fantastic_Beasts_and_Where_to_Find_Them  Animales fantásticos y dónde encontrarlos  \n",
            "http://dbpedia.org/resource/Fallen_(Kate_novel)  Oscuros (novela)  \n",
            "http://dbpedia.org/resource/Forest_of_the_Pygmies  El bosque de los pigmeos  \n",
            "http://dbpedia.org/resource/Grave_Sight  El club de los muertos  \n",
            "http://dbpedia.org/resource/Rapture_(Kate_novel)  La primera maldición  \n",
            "http://dbpedia.org/resource/Grendel_(novel)  Grendel (novela)  \n",
            "http://dbpedia.org/resource/Harry_Potter_and_the_Chamber_of_Secrets  Harry Potter y la cámara secreta  \n",
            "http://dbpedia.org/resource/Harry_Potter_and_the_Chamber_of_Secrets  Harry Potter y la cámara secreta (película)  \n",
            "http://dbpedia.org/resource/Harry_Potter_and_the_Goblet_of_Fire  Harry Potter y el cáliz de fuego  \n",
            "http://dbpedia.org/resource/Harry_Potter_and_the_Half-Blood_Prince  Harry Potter y el misterio del príncipe  \n",
            "http://dbpedia.org/resource/Harry_Potter_and_the_Order_of_the_Phoenix  Harry Potter y la Orden del Fénix  \n",
            "http://dbpedia.org/resource/Harry_Potter_and_the_Philosopher's_Stone  Harry Potter y la piedra filosofal  \n",
            "http://dbpedia.org/resource/Harry_Potter_and_the_Prisoner_of_Azkaban  Harry Potter y el prisionero de Azkaban  \n",
            "http://dbpedia.org/resource/The_Gathering_Storm_(novel)  La tormenta (novela)  \n",
            "http://dbpedia.org/resource/The_Hidden_Oracle  El oráculo oculto  \n",
            "http://dbpedia.org/resource/The_House_of_Hades  La casa de Hades  \n",
            "http://dbpedia.org/resource/ATLA_–_A_Story_of_the_Lost_Island  Atla  \n",
            "http://dbpedia.org/resource/A_Fine_and_Private_Place  Un lugar agradable y tranquilo  \n",
            "http://dbpedia.org/resource/A_Great_and_Terrible_Beauty  La Orden de la Academia Spence  \n",
            "http://dbpedia.org/resource/A_Memory_of_Light  Un recuerdo de luz  \n",
            "http://dbpedia.org/resource/A_Touch_of_Dead  Una pizca de muerte  \n",
            "http://dbpedia.org/resource/Across_the_Nightingale_Floor  El suelo del ruiseñor  \n",
            "http://dbpedia.org/resource/Blood_Follows  Blood Follows  \n",
            "http://dbpedia.org/resource/Blood_and_Chocolate_(novel)  Blood and Chocolate (novela)  \n",
            "http://dbpedia.org/resource/Eclipse_(Meyer_novel)  Eclipse (novela)  \n",
            "http://dbpedia.org/resource/Here,_There_Be_Dragons  Tierra de dragones  \n",
            "http://dbpedia.org/resource/Torment_(novel)  El poder de las sombras  \n",
            "http://dbpedia.org/resource/Wings_(Pike_novel)  Alas (novela)  \n",
            "http://dbpedia.org/resource/Mistborn:_Shadows_of_Self  Sombras de identidad  \n",
            "http://dbpedia.org/resource/Mistborn:_The_Alloy_of_Law  Aleación de ley  \n",
            "http://dbpedia.org/resource/Mistborn:_The_Final_Empire  El imperio final  \n",
            "http://dbpedia.org/resource/Mistborn:_The_Hero_of_Ages  El héroe de las eras  \n",
            "http://dbpedia.org/resource/Mistborn:_The_Lost_Metal  El metal perdido  \n",
            "http://dbpedia.org/resource/Artemis_Fowl:_The_Eternity_Code  Artemis Fowl: El Cubo B  \n",
            "http://dbpedia.org/resource/Artemis_Fowl_and_the_Arctic_Incident  Artemis Fowl: La cuenta atrás  \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Ya no quiero saber la URI de las novelas, pero sí quiero conocer la URI del autor o autores de cada libro\n",
        "\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select ?label ?author where {\n",
        "?s a dbo:Book ;\n",
        "   rdfs:label ?label ;\n",
        "   dbo:literaryGenre dbr:Fantasy_novel ;\n",
        "   dbo:author ?author .\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "\n",
        "}  LIMIT 100\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"  \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "hxuhSWnvtI5X",
        "outputId": "38170005-e8e5-4a9b-accc-3031c1c4d025"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Hermoso caos  http://dbpedia.org/resource/Margaret_Stohl  \n",
            "Hermoso caos  http://dbpedia.org/resource/Kami_Garcia  \n",
            "Hermosas criaturas  http://dbpedia.org/resource/Margaret_Stohl  \n",
            "Hermosas criaturas  http://dbpedia.org/resource/Kami_Garcia  \n",
            "Hermosa oscuridad  http://dbpedia.org/resource/Margaret_Stohl  \n",
            "Hermosa oscuridad  http://dbpedia.org/resource/Kami_Garcia  \n",
            "Sol de medianoche (novela)  http://dbpedia.org/resource/Stephenie_Meyer  \n",
            "Momo (novela)  http://dbpedia.org/resource/Michael_Ende  \n",
            "El amuleto de Samarkanda  http://dbpedia.org/resource/Jonathan_Stroud  \n",
            "Muerto hasta el anochecer  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "Más muerto que nunca  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "De muerto en peor  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "Todos juntos y muertos  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "Hush, Hush (novela)  http://dbpedia.org/resource/Becca_Fitzpatrick  \n",
            "Más allá de las sombras (novela)  http://dbpedia.org/resource/Brent_Weeks  \n",
            "El día del juicio mortal  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "Muerto y enterrado  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "Muerto en familia  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "Las puertas de la Casa de la Muerte  http://dbpedia.org/resource/Steven_Erikson  \n",
            "Declara (novela)  http://dbpedia.org/resource/Tim_Powers  \n",
            "Definitivamente muerta  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "El alquimista (novela)  http://dbpedia.org/resource/Paulo_Coelho  \n",
            "El reino de la noche  http://dbpedia.org/resource/William_Hope_Hodgson  \n",
            "El libro de los tres  http://dbpedia.org/resource/Lloyd_Alexander  \n",
            "Memorias del hielo  http://dbpedia.org/resource/Steven_Erikson  \n",
            "Guardianes de la noche  http://dbpedia.org/resource/Sergei_Lukyanenko  \n",
            "El juramento de Torak  http://dbpedia.org/resource/Michelle_Paver  \n",
            "La hechicera (novela)  http://dbpedia.org/resource/Michelle_Paver  \n",
            "Mareas de medianoche  http://dbpedia.org/resource/Steven_Erikson  \n",
            "El ojo del Golem  http://dbpedia.org/resource/Jonathan_Stroud  \n",
            "Príncipe mecánico  http://dbpedia.org/resource/Cassandra_Clare  \n",
            "Princesa mecánica  http://dbpedia.org/resource/Cassandra_Clare  \n",
            "El pozo de la ascensión  http://dbpedia.org/resource/Brandon_Sanderson  \n",
            "El último héroe del Olimpo  http://dbpedia.org/resource/Rick_Riordan  \n",
            "El pequeño vampiro (saga)  http://dbpedia.org/resource/Angela_Sommer-Bodenburg  \n",
            "El héroe perdido  http://dbpedia.org/resource/Rick_Riordan  \n",
            "El gremio de los magos  http://dbpedia.org/resource/Trudi_Canavan  \n",
            "La marca de Atenea  http://dbpedia.org/resource/Rick_Riordan  \n",
            "Camelot (novelas)  http://dbpedia.org/resource/T._H._White  \n",
            "La pirámide roja  http://dbpedia.org/resource/Rick_Riordan  \n",
            "El hijo de Neptuno  http://dbpedia.org/resource/Rick_Riordan  \n",
            "El árbol del verano  http://dbpedia.org/resource/Guy_Gavriel_Kay  \n",
            "El camino de las sombras (novela)  http://dbpedia.org/resource/Brent_Weeks  \n",
            "El maravilloso mago de Oz  http://dbpedia.org/resource/L._Frank_Baum  \n",
            "Living Dead in Dallas  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "Detective Esqueleto  http://dbpedia.org/resource/Derek_Landy  \n",
            "Skulduggery pleasant  http://dbpedia.org/resource/Derek_Landy  \n",
            "Ángel mecánico  http://dbpedia.org/resource/Cassandra_Clare  \n",
            "El club de los muertos  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "De muerto en peor  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "Todos juntos y muertos  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "La Casa de Cadenas  http://dbpedia.org/resource/Steven_Erikson  \n",
            "La trampa del amor  http://dbpedia.org/resource/Lauren_Kate  \n",
            "El clan de la foca  http://dbpedia.org/resource/Michelle_Paver  \n",
            "La daga  http://dbpedia.org/resource/Philip_Pullman  \n",
            "La materia oscura  http://dbpedia.org/resource/Philip_Pullman  \n",
            "El catalejo lacado  http://dbpedia.org/resource/Philip_Pullman  \n",
            "Tuck Everlasting  http://dbpedia.org/resource/Natalie_Babbitt  \n",
            "Crepúsculo (novela)  http://dbpedia.org/resource/Stephenie_Meyer  \n",
            "Profundidades  http://dbpedia.org/resource/Stephenie_Meyer  \n",
            "Túneles (novela)  http://dbpedia.org/resource/Stephenie_Meyer  \n",
            "Vencer al dragón  http://dbpedia.org/resource/Barbara_Hambly  \n",
            "George R. R. Martin: Autobiografía literaria  http://dbpedia.org/resource/George_R.R._Martin  \n",
            "Jumanji  http://dbpedia.org/resource/Chris_Van_Allsburg  \n",
            "Al filo de las sombras  http://dbpedia.org/resource/Brent_Weeks  \n",
            "La ciudad de los libros soñadores  http://dbpedia.org/resource/Walter_Moers  \n",
            "Hermano lobo (novela)  http://dbpedia.org/resource/Michelle_Paver  \n",
            "Animales fantásticos y dónde encontrarlos  http://dbpedia.org/resource/J._K._Rowling  \n",
            "Animales fantásticos y dónde encontrarlos  http://dbpedia.org/resource/Newt_Scamander  \n",
            "Oscuros (novela)  http://dbpedia.org/resource/Lauren_Kate  \n",
            "El bosque de los pigmeos  http://dbpedia.org/resource/Isabel_Allende  \n",
            "El club de los muertos  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "La primera maldición  http://dbpedia.org/resource/Lauren_Kate  \n",
            "Grendel (novela)  http://dbpedia.org/resource/John_Gardner_(American_writer)  \n",
            "Harry Potter y la cámara secreta  http://dbpedia.org/resource/J._K._Rowling  \n",
            "Harry Potter y la cámara secreta (película)  http://dbpedia.org/resource/J._K._Rowling  \n",
            "Harry Potter y el cáliz de fuego  http://dbpedia.org/resource/J._K._Rowling  \n",
            "Harry Potter y el misterio del príncipe  http://dbpedia.org/resource/J.K._Rowling  \n",
            "Harry Potter y la Orden del Fénix  http://dbpedia.org/resource/J._K._Rowling  \n",
            "Harry Potter y la piedra filosofal  http://dbpedia.org/resource/J._K._Rowling  \n",
            "Harry Potter y el prisionero de Azkaban  http://dbpedia.org/resource/J._K._Rowling  \n",
            "La tormenta (novela)  http://dbpedia.org/resource/Brandon_Sanderson  \n",
            "La tormenta (novela)  http://dbpedia.org/resource/Robert_Jordan  \n",
            "El oráculo oculto  http://dbpedia.org/resource/Rick_Riordan  \n",
            "La casa de Hades  http://dbpedia.org/resource/Rick_Riordan  \n",
            "Atla  http://dbpedia.org/resource/Ann_Eliza_Smith  \n",
            "Un lugar agradable y tranquilo  http://dbpedia.org/resource/Peter_S._Beagle  \n",
            "La Orden de la Academia Spence  http://dbpedia.org/resource/Libba_Bray  \n",
            "Un recuerdo de luz  http://dbpedia.org/resource/Brandon_Sanderson  \n",
            "Un recuerdo de luz  http://dbpedia.org/resource/Robert_Jordan  \n",
            "Una pizca de muerte  http://dbpedia.org/resource/Charlaine_Harris  \n",
            "El suelo del ruiseñor  http://dbpedia.org/resource/Lian_Hearn  \n",
            "Blood Follows  http://dbpedia.org/resource/Steven_Erikson  \n",
            "Blood and Chocolate (novela)  http://dbpedia.org/resource/Annette_Curtis_Klause  \n",
            "Eclipse (novela)  http://dbpedia.org/resource/Stephenie_Meyer  \n",
            "Tierra de dragones  http://dbpedia.org/resource/James_A._Owen  \n",
            "El poder de las sombras  http://dbpedia.org/resource/Lauren_Kate  \n",
            "Alas (novela)  http://dbpedia.org/resource/Aprilynne_Pike  \n",
            "Sombras de identidad  http://dbpedia.org/resource/Brandon_Sanderson  \n",
            "Aleación de ley  http://dbpedia.org/resource/Brandon_Sanderson  \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Lo de antes, pero con el nombre real del autor, no su URI\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select ?label ?nameAuthor where {\n",
        "?s a dbo:Book ;\n",
        "   rdfs:label ?label ;\n",
        "   dbo:literaryGenre dbr:Fantasy_novel ;\n",
        "   dbo:author ?author .\n",
        "\n",
        "   ?author dbp:name ?nameAuthor .\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "\n",
        "}  LIMIT 100\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "rz1gaAkutt4t",
        "outputId": "8499c97b-bfec-44d9-fcec-ec105088fe5c"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Príncipe mecánico       Cassandra Clare       \n",
            "Princesa mecánica       Cassandra Clare       \n",
            "Ángel mecánico       Cassandra Clare       \n",
            "Hush, Hush (novela)       Becca Fitzpatrick       \n",
            "El pozo de la ascensión       Brandon Sanderson       \n",
            "La tormenta (novela)       Brandon Sanderson       \n",
            "Un recuerdo de luz       Brandon Sanderson       \n",
            "Sombras de identidad       Brandon Sanderson       \n",
            "Aleación de ley       Brandon Sanderson       \n",
            "El imperio final       Brandon Sanderson       \n",
            "El héroe de las eras       Brandon Sanderson       \n",
            "El metal perdido       Brandon Sanderson       \n",
            "Torres de medianoche       Brandon Sanderson       \n",
            "El aliento de los dioses       Brandon Sanderson       \n",
            "Más allá de las sombras (novela)       Brent Weeks       \n",
            "El camino de las sombras (novela)       Brent Weeks       \n",
            "Al filo de las sombras       Brent Weeks       \n",
            "Detective Esqueleto       Derek Landy       \n",
            "Skulduggery pleasant       Derek Landy       \n",
            "Blood and Chocolate (novela)       Annette Curtis Klause       \n",
            "La historia del doctor Dolittle       Hugh Lofting       \n",
            "El amuleto de Samarkanda       Jonathan Stroud       \n",
            "El ojo del Golem       Jonathan Stroud       \n",
            "El alquimista (novela)       Paulo Coelho       \n",
            "Un lugar agradable y tranquilo       Peter S. Beagle       \n",
            "La tormenta (novela)       Robert Jordan       \n",
            "Un recuerdo de luz       Robert Jordan       \n",
            "Torres de medianoche       Robert Jordan       \n",
            "Jumanji       Chris Van Allsburg       \n",
            "World of Warcraft: Arthas el Ascenso del Rey Exanime       Christie Golden       \n",
            "Artemis Fowl: El Cubo B       Eoin Colfer       \n",
            "Artemis Fowl: La cuenta atrás       Eoin Colfer       \n",
            "Artemis Fowl: Encuentro en el Ártico       Eoin Colfer       \n",
            "Artemis Fowl: La venganza de Opal       Eoin Colfer       \n",
            "El pequeño vampiro (saga)       Angela Sommer-Bodenburg       \n",
            "Atla       Ann Eliza Smith       \n",
            "Alas (novela)       Aprilynne Pike       \n",
            "Alicia para los pequeños       Lewis Carroll       \n",
            "La Orden de la Academia Spence       Libba Bray       \n",
            "La Torre Oscura V: lobos del Calla       Stephen King       \n",
            "Los ojos del dragón       Stephen King       \n",
            "Sol de medianoche (novela)       Stephenie Meyer       \n",
            "Crepúsculo (novela)       Stephenie Meyer       \n",
            "Profundidades       Stephenie Meyer       \n",
            "Túneles (novela)       Stephenie Meyer       \n",
            "Eclipse (novela)       Stephenie Meyer       \n",
            "La segunda vida de Bree Tanner       Stephenie Meyer       \n",
            "Las puertas de la Casa de la Muerte       Steven Erikson       \n",
            "Memorias del hielo       Steven Erikson       \n",
            "Mareas de medianoche       Steven Erikson       \n",
            "La Casa de Cadenas       Steven Erikson       \n",
            "Blood Follows       Steven Erikson       \n",
            "Hermoso caos       Margaret Stohl       \n",
            "Hermosas criaturas       Margaret Stohl       \n",
            "Hermosa oscuridad       Margaret Stohl       \n",
            "Vencer al dragón       Barbara Hambly       \n",
            "El regreso del peregrino       Clive Staples Lewis       \n",
            "El regreso del peregrino       C. S. Lewis       \n",
            "El regreso del peregrino       C. S.  Lewis       \n",
            "Declara (novela)       Tim Powers       \n",
            "El gremio de los magos       Trudi Canavan       \n",
            "El reino de la noche       William Hope Hodgson       \n",
            "The Somnambulist       Jonathan Barnes       \n",
            "Eternidad (novela de Alyson Noël)       Alyson Noël       \n",
            "El árbol del verano       Guy Gavriel Kay       \n",
            "Ella y Allan       H. Rider Haggard       \n",
            "El bosque de los pigmeos       Isabel Allende       \n",
            "Animales fantásticos y dónde encontrarlos       J. K. Rowling       \n",
            "Harry Potter y la cámara secreta       J. K. Rowling       \n",
            "Harry Potter y la cámara secreta (película)       J. K. Rowling       \n",
            "Harry Potter y el cáliz de fuego       J. K. Rowling       \n",
            "Harry Potter y la Orden del Fénix       J. K. Rowling       \n",
            "Harry Potter y la piedra filosofal       J. K. Rowling       \n",
            "Harry Potter y el prisionero de Azkaban       J. K. Rowling       \n",
            "La leyenda de Sigurd y Gudrún       J. R. R. Tolkien       \n",
            "Tierra de dragones       James A. Owen       \n",
            "Grendel (novela)       John Gardner       \n",
            "Hermoso caos       Kami Garcia       \n",
            "Hermosas criaturas       Kami Garcia       \n",
            "Hermosa oscuridad       Kami Garcia       \n",
            "El maravilloso mago de Oz       L. Frank Baum       \n",
            "Camelot (novelas)       T. H.  White       \n",
            "Camelot (novelas)       T. H. White       \n",
            "La daga       Philip Pullman       \n",
            "La materia oscura       Philip Pullman       \n",
            "El catalejo lacado       Philip Pullman       \n",
            "Momo (novela)       Michael Ende       \n",
            "El juramento de Torak       Michelle Paver       \n",
            "La hechicera (novela)       Michelle Paver       \n",
            "El clan de la foca       Michelle Paver       \n",
            "Hermano lobo (novela)       Michelle Paver       \n",
            "El devorador de almas       Michelle Paver       \n",
            "El cazador de fantasmas       Michelle Paver       \n",
            "Tuck Everlasting       Natalie Babbitt       \n",
            "Guardianes de la noche       Sergei Lukyanenko       \n",
            "Guardianes del crepúsculo       Sergei Lukyanenko       \n",
            "Animales fantásticos y dónde encontrarlos       Newt Scamander       \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Lo de antes, pero ahora sólo quiero autores que hayan nacido en 1960 o después\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select ?label ?nameAuthor ?bdate where {\n",
        "   ?s a dbo:Book ;\n",
        "       rdfs:label ?label ;\n",
        "       dbo:literaryGenre dbr:Fantasy_novel ;\n",
        "       dbo:author ?author .\n",
        "\n",
        "   ?author dbp:name ?nameAuthor ;\n",
        "           dbp:birthDate ?bdate .\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "   FILTER(?bdate >= \"1960-01-01\"^^xsd:date)\n",
        "\n",
        "\n",
        "}  LIMIT 100\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "OiZayFFcuZLY",
        "outputId": "091aa549-3089-4233-c480-4aa5beb61b2d"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Princesa mecánica       Cassandra Clare       1973-07-27       \n",
            "Príncipe mecánico       Cassandra Clare       1973-07-27       \n",
            "Ángel mecánico       Cassandra Clare       1973-07-27       \n",
            "Hush, Hush (novela)       Becca Fitzpatrick       1979-02-03       \n",
            "El pozo de la ascensión       Brandon Sanderson       1975-12-19       \n",
            "Al filo de las sombras       Brent Weeks       1977-03-07       \n",
            "Más allá de las sombras (novela)       Brent Weeks       1977-03-07       \n",
            "El camino de las sombras (novela)       Brent Weeks       1977-03-07       \n",
            "Skulduggery pleasant       Derek Landy       1974-10-23       \n",
            "Detective Esqueleto       Derek Landy       1974-10-23       \n",
            "El amuleto de Samarkanda       Jonathan Stroud       1970-10-27       \n",
            "El ojo del Golem       Jonathan Stroud       1970-10-27       \n",
            "Sol de medianoche (novela)       Stephenie Meyer       1973-12-24       \n",
            "Profundidades       Stephenie Meyer       1973-12-24       \n",
            "Túneles (novela)       Stephenie Meyer       1973-12-24       \n",
            "Crepúsculo (novela)       Stephenie Meyer       1973-12-24       \n",
            "Animales fantásticos y dónde encontrarlos       J. K. Rowling       1965-07-31       \n",
            "Hermosas criaturas       Kami Garcia       1972-03-25       \n",
            "Hermosa oscuridad       Kami Garcia       1972-03-25       \n",
            "Hermoso caos       Kami Garcia       1972-03-25       \n",
            "Hermano lobo (novela)       Michelle Paver       1960-09-07       \n",
            "La hechicera (novela)       Michelle Paver       1960-09-07       \n",
            "El juramento de Torak       Michelle Paver       1960-09-07       \n",
            "El clan de la foca       Michelle Paver       1960-09-07       \n",
            "Guardianes de la noche       Sergei Lukyanenko       1968-04-11       \n",
            "Aleación de ley       Brandon Sanderson       1975-12-19       \n",
            "Un recuerdo de luz       Brandon Sanderson       1975-12-19       \n",
            "El héroe de las eras       Brandon Sanderson       1975-12-19       \n",
            "La tormenta (novela)       Brandon Sanderson       1975-12-19       \n",
            "Sombras de identidad       Brandon Sanderson       1975-12-19       \n",
            "El metal perdido       Brandon Sanderson       1975-12-19       \n",
            "El imperio final       Brandon Sanderson       1975-12-19       \n",
            "Artemis Fowl: La cuenta atrás       Eoin Colfer       1965-05-14       \n",
            "Artemis Fowl: La venganza de Opal       Eoin Colfer       1965-05-14       \n",
            "Artemis Fowl: El Cubo B       Eoin Colfer       1965-05-14       \n",
            "Artemis Fowl: Encuentro en el Ártico       Eoin Colfer       1965-05-14       \n",
            "La Orden de la Academia Spence       Libba Bray       1964-03-11       \n",
            "Eclipse (novela)       Stephenie Meyer       1973-12-24       \n",
            "Eternidad (novela de Alyson Noël)       Alyson Noël       1965-12-03       \n",
            "Harry Potter y la cámara secreta (película)       J. K. Rowling       1965-07-31       \n",
            "Harry Potter y la Orden del Fénix       J. K. Rowling       1965-07-31       \n",
            "Harry Potter y el prisionero de Azkaban       J. K. Rowling       1965-07-31       \n",
            "Harry Potter y el cáliz de fuego       J. K. Rowling       1965-07-31       \n",
            "Harry Potter y la cámara secreta       J. K. Rowling       1965-07-31       \n",
            "Harry Potter y la piedra filosofal       J. K. Rowling       1965-07-31       \n",
            "El devorador de almas       Michelle Paver       1960-09-07       \n",
            "El cazador de fantasmas       Michelle Paver       1960-09-07       \n",
            "Torres de medianoche       Brandon Sanderson       1975-12-19       \n",
            "World of Warcraft: Arthas el Ascenso del Rey Exanime       Christie Golden       1963-11-21       \n",
            "La segunda vida de Bree Tanner       Stephenie Meyer       1973-12-24       \n",
            "Guardianes del crepúsculo       Sergei Lukyanenko       1968-04-11       \n",
            "El aliento de los dioses       Brandon Sanderson       1975-12-19       \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Autores que han escrito algún libro de fantasía y nacidos después de 1960\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select distinct ?nameAuthor ?bdate where {\n",
        "   ?s a dbo:Book ;\n",
        "       rdfs:label ?label ;\n",
        "       dbo:literaryGenre dbr:Fantasy_novel ;\n",
        "       dbo:author ?author .\n",
        "\n",
        "   ?author dbp:name ?nameAuthor ;\n",
        "           dbp:birthDate ?bdate .\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "   FILTER(?bdate >= \"1960-01-01\"^^xsd:date)\n",
        "\n",
        "\n",
        "}  LIMIT 100\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "6-3BaaoMwcOU",
        "outputId": "5fd0f7f8-df79-4d81-879e-078305b53b6f"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Cassandra Clare       1973-07-27       \n",
            "Becca Fitzpatrick       1979-02-03       \n",
            "Brandon Sanderson       1975-12-19       \n",
            "Brent Weeks       1977-03-07       \n",
            "Derek Landy       1974-10-23       \n",
            "Jonathan Stroud       1970-10-27       \n",
            "Stephenie Meyer       1973-12-24       \n",
            "J. K. Rowling       1965-07-31       \n",
            "Kami Garcia       1972-03-25       \n",
            "Michelle Paver       1960-09-07       \n",
            "Sergei Lukyanenko       1968-04-11       \n",
            "Eoin Colfer       1965-05-14       \n",
            "Libba Bray       1964-03-11       \n",
            "Alyson Noël       1965-12-03       \n",
            "Christie Golden       1963-11-21       \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Esos mismos autores pero ordenados por edad de forma descendente\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select distinct ?nameAuthor ?bdate where {\n",
        "   ?s a dbo:Book ;\n",
        "       rdfs:label ?label ;\n",
        "       dbo:literaryGenre dbr:Fantasy_novel ;\n",
        "       dbo:author ?author .\n",
        "\n",
        "   ?author dbp:name ?nameAuthor ;\n",
        "           dbp:birthDate ?bdate .\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "   FILTER(?bdate >= \"1960-01-01\"^^xsd:date)\n",
        "\n",
        "\n",
        "}  ORDER BY DESC(?bdate)\n",
        "   LIMIT 100\n",
        "\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "h3wKtIQVwsZm",
        "outputId": "bd6d8f9f-acaf-45a3-81de-3f3568e36423"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Becca Fitzpatrick       1979-02-03       \n",
            "Brent Weeks       1977-03-07       \n",
            "Brandon Sanderson       1975-12-19       \n",
            "Derek Landy       1974-10-23       \n",
            "Stephenie Meyer       1973-12-24       \n",
            "Cassandra Clare       1973-07-27       \n",
            "Kami Garcia       1972-03-25       \n",
            "Jonathan Stroud       1970-10-27       \n",
            "Sergei Lukyanenko       1968-04-11       \n",
            "Alyson Noël       1965-12-03       \n",
            "J. K. Rowling       1965-07-31       \n",
            "Eoin Colfer       1965-05-14       \n",
            "Libba Bray       1964-03-11       \n",
            "Christie Golden       1963-11-21       \n",
            "Michelle Paver       1960-09-07       \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Todo lo anterior pero, además, quiero saber cuántas novelas de fantasía escribieron cada uno.\n",
        "# Y, además, ordenaré los resultados por número de novelas, no por fecha de nacimiento\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select  distinct ?nameAuthor ?bdate (count(?s) as ?numBooks) where {\n",
        "   ?s a dbo:Book ;\n",
        "       rdfs:label ?label ;\n",
        "       dbo:literaryGenre dbr:Fantasy_novel ;\n",
        "       dbo:author ?author .\n",
        "\n",
        "   ?author dbp:name ?nameAuthor ;\n",
        "           dbp:birthDate ?bdate .\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "   FILTER(?bdate >= \"1960-01-01\"^^xsd:date)\n",
        "\n",
        "\n",
        "}  ORDER BY DESC(?numBooks)\n",
        "   LIMIT 100\n",
        "\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "fI388AaixP11",
        "outputId": "61a9093e-de82-4ffb-ee78-bcb19380ea5a"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Brandon Sanderson       1975-12-19       10       \n",
            "J. K. Rowling       1965-07-31       7       \n",
            "Michelle Paver       1960-09-07       6       \n",
            "Stephenie Meyer       1973-12-24       6       \n",
            "Eoin Colfer       1965-05-14       4       \n",
            "Brent Weeks       1977-03-07       3       \n",
            "Cassandra Clare       1973-07-27       3       \n",
            "Kami Garcia       1972-03-25       3       \n",
            "Sergei Lukyanenko       1968-04-11       2       \n",
            "Derek Landy       1974-10-23       2       \n",
            "Jonathan Stroud       1970-10-27       2       \n",
            "Christie Golden       1963-11-21       1       \n",
            "Becca Fitzpatrick       1979-02-03       1       \n",
            "Libba Bray       1964-03-11       1       \n",
            "Alyson Noël       1965-12-03       1       \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Prueba en esta última consulta a poner valores distintos al filtro de lengua. O a quitar el filtro de lengua. Esto te ayudará a entender el funcionamiento de count. Auqnue contemos ?s, que representa un libro, no contamos exactamente las URIs de libros. Contamos las veces para las que, para una combinación de ?authorName y ?bdate, que son las otras dos variables de la select, encajan en un patrón nuevo de grafo con todo lo que tenemos en la consulta. Si, por ejemplo, quitas el filtro, saldrá que JK Rowling tiene más de 140 libros. No es así en realidad, ni es así en DBpedia. Pero al tener etiquetas traducidas a muchos lenguajes por cada uno de sus libros, el patrón encaja con distintos datos todas esas veces.\n",
        "\n",
        "\n",
        "Para seguir viendo elemento de SPARQL vamos a quitar el count en las siguientes consultas, para no complicar las cosas más de lo necesario.\n",
        "\n"
      ],
      "metadata": {
        "id": "qBrpAZJ5zYWu"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# Autores \"jovenes\" con libros de fantasía. Si está la información de donde nacieron, que salga. Y si no no pasa nada, que no salga.\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
        "sparql.setQuery(\"\"\"\n",
        "    select  distinct ?nameAuthor ?bdate ?place where {\n",
        "   ?s a dbo:Book ;\n",
        "       rdfs:label ?label ;\n",
        "       dbo:literaryGenre dbr:Fantasy_novel ;\n",
        "       dbo:author ?author .\n",
        "\n",
        "   ?author dbp:name ?nameAuthor ;\n",
        "           dbp:birthDate ?bdate .\n",
        "\n",
        "   OPTIONAL { ?author dbp:birthPlace ?place }\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "   FILTER(?bdate >= \"1960-01-01\"^^xsd:date)\n",
        "\n",
        "\n",
        "}  ORDER BY DESC(?bdate)\n",
        "   LIMIT 100\n",
        "\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "zRhPHQe1609t",
        "outputId": "745b8c52-5c37-403f-c0d2-3b316b1a29dc"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Becca Fitzpatrick       1979-02-03       \n",
            "Brent Weeks       1977-03-07       Montana, USA       \n",
            "Brandon Sanderson       1975-12-19       Lincoln, Nebraska, U.S.       \n",
            "Derek Landy       1974-10-23       Lusk, County Dublin, Ireland       \n",
            "Stephenie Meyer       1973-12-24       Hartford, Connecticut, U.S.       \n",
            "Cassandra Clare       1973-07-27       Tehran, Iran       \n",
            "Kami Garcia       1972-03-25       \n",
            "Jonathan Stroud       1970-10-27       Bedford, England       \n",
            "Sergei Lukyanenko       1968-04-11       http://dbpedia.org/resource/Karatau,_Kazakhstan       \n",
            "Sergei Lukyanenko       1968-04-11       http://dbpedia.org/resource/Soviet_Union       \n",
            "Alyson Noël       1965-12-03       Laguna Beach, California, United States       \n",
            "J. K. Rowling       1965-07-31       Yate, Gloucestershire, England       \n",
            "Eoin Colfer       1965-05-14       Wexford, Ireland       \n",
            "Libba Bray       1964-03-11       http://dbpedia.org/resource/United_States       \n",
            "Libba Bray       1964-03-11       http://dbpedia.org/resource/Montgomery,_Alabama       \n",
            "Christie Golden       1963-11-21       Atlanta, Georgia, USA       \n",
            "Michelle Paver       1960-09-07       Nyasaland       \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Toda la información y condiciones anteriores. Pero ahora quiero autores con libros de fantasía y/o distopías\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "    select  distinct ?nameAuthor ?bdate ?place where {\n",
        "   { ?s a dbo:Book ;\n",
        "       rdfs:label ?label ;\n",
        "       dbo:literaryGenre dbr:Fantasy_novel ;\n",
        "       dbo:author ?author .\n",
        "\n",
        "   ?author dbp:name ?nameAuthor ;\n",
        "           dbp:birthDate ?bdate .\n",
        "\n",
        "   OPTIONAL { ?author dbp:birthPlace ?place }\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "   FILTER(?bdate >= \"1960-01-01\"^^xsd:date)\n",
        "  }\n",
        "\n",
        "  UNION\n",
        "\n",
        "  { ?s a dbo:Book ;\n",
        "       rdfs:label ?label ;\n",
        "       dbo:literaryGenre dbr:Utopian_and_dystopian_fiction ;\n",
        "       dbo:author ?author .\n",
        "\n",
        "   ?author dbp:name ?nameAuthor ;\n",
        "           dbp:birthDate ?bdate .\n",
        "\n",
        "   OPTIONAL { ?author dbp:birthPlace ?place }\n",
        "\n",
        "   FILTER(lang(?label) = \"es\")\n",
        "   FILTER(?bdate >= \"1960-01-01\"^^xsd:date)\n",
        "  }\n",
        "\n",
        "}  ORDER BY DESC(?bdate)\n",
        "   LIMIT 100\n",
        "\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "E9DC2sBz8KtN",
        "outputId": "23756cda-8d0e-480b-9b07-4227690940b6"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Christopher Paolini       1983-11-17       Los Angeles, California, U.S.       \n",
            "Becca Fitzpatrick       1979-02-03       \n",
            "Brent Weeks       1977-03-07       Montana, USA       \n",
            "Brandon Sanderson       1975-12-19       Lincoln, Nebraska, U.S.       \n",
            "Derek Landy       1974-10-23       Lusk, County Dublin, Ireland       \n",
            "Stephenie Meyer       1973-12-24       Hartford, Connecticut, U.S.       \n",
            "Cassandra Clare       1973-07-27       Tehran, Iran       \n",
            "Ernest Cline       1972-03-29       Ashland, Ohio, U.S.       \n",
            "Kami Garcia       1972-03-25       \n",
            "Jonathan Stroud       1970-10-27       Bedford, England       \n",
            "Dave Eggers       1970-03-12       Boston, Massachusetts, U.S.       \n",
            "Sergei Lukyanenko       1968-04-11       http://dbpedia.org/resource/Karatau,_Kazakhstan       \n",
            "Sergei Lukyanenko       1968-04-11       http://dbpedia.org/resource/Soviet_Union       \n",
            "Alyson Noël       1965-12-03       Laguna Beach, California, United States       \n",
            "J. K. Rowling       1965-07-31       Yate, Gloucestershire, England       \n",
            "Eoin Colfer       1965-05-14       Wexford, Ireland       \n",
            "Libba Bray       1964-03-11       http://dbpedia.org/resource/United_States       \n",
            "Libba Bray       1964-03-11       http://dbpedia.org/resource/Montgomery,_Alabama       \n",
            "Christie Golden       1963-11-21       Atlanta, Georgia, USA       \n",
            "Michelle Paver       1960-09-07       Nyasaland       \n",
            "--------\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Existen más funciones, más lógica de conjuntos, etc. Pero a partir de aquñi probablemente tenga más sentido consultar documentación de SPARQL si necesitas algo fuera de lo visto.\n",
        "\n",
        "Queda por abordar el macanismo que, sobre el papel, da tanta potencia por facilidad de integración a los estándares de web semántica: consultas federadas. La posibilidad de mezclar la información de un endpoint con otro.\n",
        "\n",
        "Para a¡hacer una consulta federada, dentro de nuestra SELECT tenemos que incluir la sentencia SERVICE, seguida por la URL del endpoint objetivo, y entre llaves un atrón de grafo que se debe cumplir en el endpoint objetivo. La gracia es que fuera del service y dentro del service se tendría que estar haciendo referencia a algún elemento común (una URI presente en ambos endpoints) que me permita unir los grafos.\n",
        "\n",
        "Para este ejemplo, no obstante, no podemos usar el endpoint de DBpedia como base. El endpoint público de DBpedia (la instalación de ese endpoint, no el motor Virtuoso por defecto) no permite federación como medida de seguridad. El siguietne código (fallará) es sintaxis válida para sacar las propiedades que haya en Wikidata de cualqueir libro de Brandon Sanderson que tenga un enlace explícito de DBpedia a Wikidata:"
      ],
      "metadata": {
        "id": "xXPnyvQc9EvP"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# Información en Wikidata de libros de Brandon Sanderson que están en DPbedia\n",
        "\n",
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "\n",
        "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
        "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
        "\n",
        "select  distinct ?nameAuthor ?p ?o where {\n",
        "   ?s a dbo:Book ;\n",
        "       rdfs:label ?label ;\n",
        "       dbo:author ?Brandon_Sanderson ;\n",
        "       owl:sameAs ?wikiURI .\n",
        "\n",
        "    SERVICE <https://query.wikidata.org/sparql> {\n",
        "      ?wikiURI    wdt:P50 wd:Q28392 ;  # P50 = Autor, Q28392 = Brandon Sanderson\n",
        "                  wdt:P31 wd:Q571 ;  # P31 = Instancia de, Q571 = Libro\n",
        "                  ?p ?o .\n",
        "    }\n",
        "}  LIMIT 100\n",
        "\n",
        "  \"\"\"\n",
        "    )\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 524
        },
        "id": "duUq9ZW0-26-",
        "outputId": "8a4f4376-8f12-4742-a728-6dba1d24e4ec"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "error",
          "ename": "EndPointInternalError",
          "evalue": "EndPointInternalError: The endpoint returned the HTTP status code 500. \n\nResponse:\nb'Virtuoso 42000 Error SQ070:SECURITY: Must have SELECT privileges on view DB.DBA.SPARQL_SINV_2 for group ID 111 (SPARQL), user ID 111 (SPARQL)\\n\\nSPARQL query:\\n#output-format:application/sparql-results+json\\n\\n\\n    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\\n    PREFIX wd: <http://www.wikidata.org/entity/>\\n\\n    select  distinct ?nameAuthor ?bdate ?place where {\\n   ?s a dbo:Book ;\\n       rdfs:label ?label ;\\n       dbo:author ?Brandon_Sanderson ;\\n       owl:sameAs ?wikiURI .\\n      \\n    SERVICE <https://query.wikidata.org/sparql> {\\n      ?wikiURI    wdt:P50 wd:Q28392 ;  # P50 = Autor, Q28392 = Brandon Sanderson\\n                  wdt:P31 wd:Q571 ;  # P31 = Instancia de, Q571 = Libro\\n                  ?p ?o .\\n                      \\n                  \\n    }\\n\\n   \\n}  LIMIT 100\\n   \\n  \\n'",
          "traceback": [
            "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
            "\u001b[0;31mHTTPError\u001b[0m                                 Traceback (most recent call last)",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    925\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 926\u001b[0;31m                 \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlopener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    927\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreturnFormat\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(url, data, timeout, cafile, capath, cadefault, context)\u001b[0m\n\u001b[1;32m    215\u001b[0m         \u001b[0mopener\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_opener\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 216\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mopener\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    217\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36mopen\u001b[0;34m(self, fullurl, data, timeout)\u001b[0m\n\u001b[1;32m    524\u001b[0m             \u001b[0mmeth\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprocessor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 525\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmeth\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    526\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36mhttp_response\u001b[0;34m(self, request, response)\u001b[0m\n\u001b[1;32m    633\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0;36m200\u001b[0m \u001b[0;34m<=\u001b[0m \u001b[0mcode\u001b[0m \u001b[0;34m<\u001b[0m \u001b[0;36m300\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 634\u001b[0;31m             response = self.parent.error(\n\u001b[0m\u001b[1;32m    635\u001b[0m                 'http', request, response, code, msg, hdrs)\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36merror\u001b[0;34m(self, proto, *args)\u001b[0m\n\u001b[1;32m    556\u001b[0m         \u001b[0margs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mproto\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0margs\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 557\u001b[0;31m         \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_call_chain\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    558\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36m_call_chain\u001b[0;34m(self, chain, kind, meth_name, *args)\u001b[0m\n\u001b[1;32m    495\u001b[0m             \u001b[0mfunc\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 496\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    497\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36mhttp_error_302\u001b[0;34m(self, req, fp, code, msg, headers)\u001b[0m\n\u001b[1;32m    748\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 749\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mparent\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mnew\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    750\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36mopen\u001b[0;34m(self, fullurl, data, timeout)\u001b[0m\n\u001b[1;32m    524\u001b[0m             \u001b[0mmeth\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprocessor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 525\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmeth\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    526\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36mhttp_response\u001b[0;34m(self, request, response)\u001b[0m\n\u001b[1;32m    633\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0;36m200\u001b[0m \u001b[0;34m<=\u001b[0m \u001b[0mcode\u001b[0m \u001b[0;34m<\u001b[0m \u001b[0;36m300\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 634\u001b[0;31m             response = self.parent.error(\n\u001b[0m\u001b[1;32m    635\u001b[0m                 'http', request, response, code, msg, hdrs)\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36merror\u001b[0;34m(self, proto, *args)\u001b[0m\n\u001b[1;32m    562\u001b[0m             \u001b[0margs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'default'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'http_error_default'\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0morig_args\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 563\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_call_chain\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    564\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36m_call_chain\u001b[0;34m(self, chain, kind, meth_name, *args)\u001b[0m\n\u001b[1;32m    495\u001b[0m             \u001b[0mfunc\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 496\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    497\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/lib/python3.11/urllib/request.py\u001b[0m in \u001b[0;36mhttp_error_default\u001b[0;34m(self, req, fp, code, msg, hdrs)\u001b[0m\n\u001b[1;32m    642\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mhttp_error_default\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 643\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mHTTPError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfull_url\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    644\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;31mHTTPError\u001b[0m: HTTP Error 500: SPARQL Request Failed",
            "\nDuring handling of the above exception, another exception occurred:\n",
            "\u001b[0;31mEndPointInternalError\u001b[0m                     Traceback (most recent call last)",
            "\u001b[0;32m<ipython-input-65-327ba898ddee>\u001b[0m in \u001b[0;36m<cell line: 0>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     32\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     33\u001b[0m \u001b[0msparql\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msetReturnFormat\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mJSON\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 34\u001b[0;31m \u001b[0mresults\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msparql\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     35\u001b[0m \u001b[0;32mfor\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mresults\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m\"results\"\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m\"bindings\"\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     36\u001b[0m     \u001b[0;32mfor\u001b[0m \u001b[0ma_var_key\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    958\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;34m:\u001b[0m\u001b[0;32mclass\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m`\u001b[0m\u001b[0mQueryResult\u001b[0m\u001b[0;31m`\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    959\u001b[0m         \"\"\"\n\u001b[0;32m--> 960\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mQueryResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    961\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    962\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mqueryAndConvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m->\u001b[0m \u001b[0;34m\"QueryResult.ConvertResult\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    936\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mURITooLong\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    937\u001b[0m             \u001b[0;32melif\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m500\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 938\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mEndPointInternalError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    939\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    940\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;31mEndPointInternalError\u001b[0m: EndPointInternalError: The endpoint returned the HTTP status code 500. \n\nResponse:\nb'Virtuoso 42000 Error SQ070:SECURITY: Must have SELECT privileges on view DB.DBA.SPARQL_SINV_2 for group ID 111 (SPARQL), user ID 111 (SPARQL)\\n\\nSPARQL query:\\n#output-format:application/sparql-results+json\\n\\n\\n    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\\n    PREFIX wd: <http://www.wikidata.org/entity/>\\n\\n    select  distinct ?nameAuthor ?bdate ?place where {\\n   ?s a dbo:Book ;\\n       rdfs:label ?label ;\\n       dbo:author ?Brandon_Sanderson ;\\n       owl:sameAs ?wikiURI .\\n      \\n    SERVICE <https://query.wikidata.org/sparql> {\\n      ?wikiURI    wdt:P50 wd:Q28392 ;  # P50 = Autor, Q28392 = Brandon Sanderson\\n                  wdt:P31 wd:Q571 ;  # P31 = Instancia de, Q571 = Libro\\n                  ?p ?o .\\n                      \\n                  \\n    }\\n\\n   \\n}  LIMIT 100\\n   \\n  \\n'"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Como ves en la traza de error, esto no funciona por algo relacionado con permisos, no tiene nada que ver con como de conectada está la información a nivel de datos. De hecho, si intentamos hacer esto mismo pero al revés, es decir, tirar esta consulta contra el endpoint de Wikidata tratando de federar el endpoint de DBpedia, sí podemos ejecutar la consulta.\n"
      ],
      "metadata": {
        "id": "NCBJbWcoDHh-"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")  # Construimos un objeto para acceder a cierto endpoint. En este caso, DBpedia\n",
        "sparql.setQuery(\"\"\"\n",
        "\n",
        "prefix wdt: <http://www.wikidata.org/prop/direct/>\n",
        "prefix wd: <http://www.wikidata.org/entity/>\n",
        "prefix wikibase: <http://wikiba.se/ontology#>\n",
        "prefix dbr: <http://dbpedia.org/resource/>\n",
        "prefix dbo: <http://dbpedia.org/ontology/>\n",
        "prefix dbp: <http://dbpedia.org/property/>\n",
        "\n",
        "SELECT DISTINCT ?obra_dbpedia ?p ?o WHERE {\n",
        "  ?obra_wikidata wdt:P50 wd:Q457608 ;\n",
        "                 wdt:P31 wd:Q1667921 ;\n",
        "                 ?p ?o .\n",
        "\n",
        "  SERVICE <http://dbpedia.org/sparql> {\n",
        "    ?obra_dbpedia owl:sameAs ?obra_wikidata ;\n",
        "                  dbp:author dbr:Brandon_Sanderson .\n",
        "\n",
        "  }\n",
        "\n",
        "} LIMIT 100\n",
        "\n",
        "  \"\"\"\n",
        "    )\n",
        "\n",
        "sparql.setReturnFormat(JSON)\n",
        "results = sparql.query().convert()\n",
        "for result in results[\"results\"][\"bindings\"]:\n",
        "    for a_var_key in result:\n",
        "      print(result[a_var_key][\"value\"], end=\"       \")\n",
        "    print()\n",
        "print(\"--------\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "8ov_PUtaI2h8",
        "outputId": "b51452cc-e04c-476d-9868-5edb88a3591a"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "http://schema.org/version       2299571138       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       knižní fantasy série Roberta Jordana       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       La roda del temps       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Кола Часу       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       RdT       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       WoT       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       Dodecalogia de noveŀles de fantasia d'en Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Ο Τροχός του Χρόνου       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       fantáziaregény-sorozat       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       WoT       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       zbirka fantazijskih romanov Roberta Jordana       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Kolo časa       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://wikiba.se/ontology#statements       59       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://wikiba.se/ontology#sitelinks       38       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://wikiba.se/ontology#identifiers       26       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Rad der Zeit       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       La rueda del tiempo       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       La Roue du temps       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       時間之輪       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       چرخ زمان       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       時光之輪       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Das Rad der Zeit       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Koło Czasu       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Vita tornet       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       סדרת ספרי פנטזיה       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       عجلة الزمن       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       מחזור כישור הזמן       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Az Idő Kereke       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       La Ruota del Tempo       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       時の車輪       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Sagan om Drakens återkomst       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Колесо часу       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Zaman Çarkı       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       سلسلة روايات خيال علمي       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       сэрыя фэнтэзійных раманаў пісьменьніка Робэрта Джордана       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Кола часу       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Колелото на времето       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Rod an amzer       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Točak vremena       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Wheel Of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Kolo času       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       Romanzyklus von Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       WoT       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       series of fantasy novels by Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       serio de fantastaj romanoj far Roberto Jordano       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       La Rado de Tempo       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       saga literaria creada por Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Myrddraali       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Trollokki       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       سری رمان خیالپردازی حماسی اثر نویسنده آمریکایی جیمز الیور ریگنی جونیور با تخلص رابرت جوردن       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       Robert Jordanin fantasiaromaanisarja       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Ajan pyörä       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       série de romans de fantasy écrite par Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       כישור הזמן       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       A Roda do Tempo       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Il Pugnale dei Sogni       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       L’Ascesa dell’Ombra       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       serie di romanzi fantasy scritta da Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       დროის ბორბალი       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Rota Temporis       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       The Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Rad des tijds       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       fantasy-serie       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       The wheel of time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       पुस्तक श्रृंखला       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Tidshjulet       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       boekenserie van Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       वोत       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Het Rad des Tijds       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Tidshjulet       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Roata Timpului       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       A Roda do Tempo       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       série de alta fantasia criado por Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Колесо времён       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       serie de romane fantastice de Robert Jordan, completată de Brandon Sanderson       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Roata timpului       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Колесо Времени       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Točak vremena       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Drakens återkomst       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Osan'gar       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       Wheel of Time       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       Точак времена       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/description       fantasy-bokserie skriven av Robert Jordan       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2004/02/skos/core#altLabel       时光之轮       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://www.w3.org/2000/01/rdf-schema#label       時間之輪       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "http://schema.org/dateModified       2025-01-18T21:25:33Z       http://dbpedia.org/resource/The_Wheel_of_Time       \n",
            "--------\n"
          ]
        }
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}